#include<stdio.h>

//输出菜单1号，选择排序方法
//参数：无
void menu1()
{
	printf("_____________排序方法___________\n");
	printf("1.插入排序\n");
	printf("2.归并排序\n");
	printf("3.快速排序\n");
	printf("4.快速排序（非递归）\n");
	printf("5.快速排序（随机轴）\n");
	printf("6.快速排序（三枢轴）\n");
	printf("7.计数排序\n");
	printf("8.基数排序\n");
	printf("9.冒泡排序（优化一）：设立标志\n");
	printf("10.冒泡排序（优化二）：双向沉浮\n");
	printf("11.冒泡排序（优化三）：标志加沉浮\n");
	printf("12.退出\n");
	printf("_______________________________\n");
}


//输出菜单2号，选择测试选项
//参数：无
void menu2()
{
	printf("____________测试选项__________\n");
	printf("1.正常测试\n");
	printf("2.大数据量测试\n");
	printf("3.大量小数据量测试\n");
	printf("4.退出\n");
	printf("______________________________\n");
}

//输出菜单3号，选择大数据量选项
//参数：无
void menu3()
{
	printf("____________大数据量选项__________\n");
	printf("1.10000\n");
	printf("2.50000\n");
	printf("3.200000\n");
	printf("4.退出\n");
	printf("__________________________________\n");
}

//输出菜单4号，选择大量小数据量选项
//参数：无
void menu4() 
{
	printf("____________大量小数据量选项__________\n");
	printf("1.100*10k\n");
	printf("2.100*50k\n");
	printf("3.100*200k\n");
	printf("4.退出\n");
	printf("__________________________________\n");
}